OpenFOAM-7-master/tutorials/multiphase/twoLiquidMixingFoam/lockExchange/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

runApplication blockMesh
runApplication setFields
runApplication $application

#------------------------------------------------------------------------------
